# Сообщаем докеру откуда брать образ (image) либо он возьмет его локально либо с докер хаба
# В данном случае код выполняется в среде node js поэтому и образ мы берем node
FROM node
# Рабочая директория в которой находится наше приложение
WORKDIR /app

COPY package.json /app/
# Запускаем установку node modules
RUN npm install
# Так как мы находимся в контексте /app, то можем написать "." что будет означать тоже самое что и /app
COPY . .

ENV PORT=3000
# При запуске приложения мы используем 3000 порт
EXPOSE ${PORT}
# Настройка для сохранения данных при удалении контейнера
VOLUME [ "/app/data" ]
# Разницей между RUN и CMD, заключается в том, что,
# RUN запускается, когда мы собираем сам ОБРАЗ
# CMD запускается каждый раз когда мы ЗАПУСКАЕМ ОБРАЗ
CMD ["node", "app.js"]



